FormicRobotics/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	return 0;
}

// Show what non-eRPM frames a channel has received: latest value (with units where the spec has
// them) and how many of each type.
static void print_edt_status(uint8_t channel_index)
{
	char line[160];
	size_t n = 0;

	for (unsigned type = 0; type < EDT_NUM_TYPES && n < sizeof(line); type++) {
		if (edt_count[channel_index][type] == 0) {
			continue;
		}

		const unsigned raw = edt_last[channel_index][type];
		int len;

		switch (type) {
		case 0:
			len = snprintf(line + n, sizeof(line) - n, " temp=%uC", raw);
			break;

		case 1:
			// raw byte first, then what it is at the spec scale (0.25 V per LSB)
			len = snprintf(line + n, sizeof(line) - n, " volt=raw%u(%u.%02uV)", raw, raw / 4, (raw % 4) * 25);
			break;

		case 2:
			len = snprintf(line + n, sizeof(line) - n, " curr=%uA", raw);
			break;

		case 6:
			len = snprintf(line + n, sizeof(line) - n, " status=0x%02x", raw);
			break;

		default:
			len = snprintf(line + n, sizeof(line) - n, " %s=%u", edt_type_names[type], raw);
			break;
		}

		if (len < 0) {
			break;
		}

		n += len;

		if (n < sizeof(line)) {
			n += snprintf(line + n, sizeof(line) - n, "(x%lu)", edt_count[channel_index][type]);
		}
	}

	if (n == 0) {
		PX4_INFO("  Channel %u EDT: no extended frames received", channel_index);

	} else {
		PX4_INFO("  Channel %u EDT:%s", channel_index, line);
	}
}

void up_bdshot_set_edt_enabled(bool enabled)
{
	_edt_enabled = enabled;
}

int up_bdshot_get_edt(uint8_t output_channel, dshot_edt_type_t type, uint8_t *value, uint32_t *age_ms)
{
	if (output_channel >= MAX_TIMER_IO_CHANNELS || (unsigned)type >= EDT_NUM_TYPES) {
		return -EINVAL;
	}

	uint8_t timer_index = timer_io_channels[output_channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;

	// eRPM (and so EDT) is only read on the bidirectional timer
	if (timer_index != _bidi_timer_index || !timer_configs[timer_index].initialized_channels[timer_channel_index]) {
		return -ENODEV;
	}

	const hrt_abstime received = edt_last_time[timer_channel_index][type];

	if (received == 0) {
		return -ENODATA;
	}

	*value = edt_last[timer_channel_index][type];
	*age_ms = (uint32_t)(hrt_elapsed_time(&received) / 1000);
	return OK;
}

void up_bdshot_status(void)
{
	PX4_INFO("dshot driver stats:");

	if (_bidirectional) {
		PX4_INFO("Bidirectional DShot enabled");
	}

	uint8_t timer_index = _bidi_timer_index;

	for (uint8_t timer_channel_index = 0; timer_channel_index < MAX_NUM_CHANNELS_PER_TIMER; timer_channel_index++) {
		bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

		if (channel_initialized) {
			PX4_INFO("Timer %u, Channel %u: read %lu, failed nibble %lu, failed CRC %lu, invalid/zero %lu",
				 timer_index, timer_channel_index,
				 read_ok[timer_channel_index],
				 read_fail_nibble[timer_channel_index],
				 read_fail_crc[timer_channel_index],
				 read_fail_zero[timer_channel_index]);

			if (_edt_enabled) {
				print_edt_status(timer_channel_index);
			}
		}
	}
}

uint8_t nibbles_from_mapped(uint8_t mapped)
{
	switch (mapped) {
	case 0x19:
		return 0x00;

	case 0x1B:
		return 0x01;

	case 0x12:
		return 0x02;

	case 0x13:
		return 0x03;

	case 0x1D:
		return 0x04;

	case 0x15:
		return 0x05;

	case 0x16:
		return 0x06;

	case 0x17:
		return 0x07;

	case 0x1a:
		return 0x08;

	case 0x09:
		return 0x09;

	case 0x0A:
		return 0x0A;

	case 0x0B:
		return 0x0B;

	case 0x1E:
		return 0x0C;

	case 0x0D:
		return 0x0D;

	case 0x0E:
		return 0x0E;

	case 0x0F:
		return 0x0F;

	default:
		// Unknown mapped
		return 0xFF;
	}
}

unsigned calculate_period(uint8_t timer_index, uint8_t channel_index, bool *is_edt)
{
	*is_edt = false;

	uint32_t value = 0;
	uint32_t high = 1; // We start off with high
	unsigned shifted = 0;

	// We can ignore the very first data point as it's the pulse before it starts.
	unsigned previous = dshot_capture_buffer[channel_index][1];

	// Loop through the capture buffer for the specified channel
	for (unsigned i = 2; i < CHANNEL_CAPTURE_BUFF_SIZE; ++i) {

		if (dshot_capture_buffer[channel_index][i] == 0) {
			// Once we get zeros we're through
			break;
		}

		// This seemss to work with dshot 150, 300, 600, 1200
		// The values were found by trial and error to get the quantization just right.
		const uint32_t bits = (dshot_capture_buffer[channel_index][i] - previous + 5) / 20;

		// Convert GCR encoded pulse train into value
		for (unsigned bit = 0; bit < bits; ++bit) {
			value = (value << 1) | high;
			++shifted;
		}

		// The next edge toggles.
		high = !high;

		previous = dshot_capture_buffer[channel_index][i];
	}

	if (shifted == 0) {
		// no data yet, or this time
		++read_fail_zero[channel_index];
		return 0;
	}

	// We need to make sure we shifted 21 times. We might have missed some low "pulses" at the very end.
	value <<= (21 - shifted);

	// From GCR to eRPM according to:
	// https://brushlesswhoop.com/dshot-and-bidirectional-dshot/#erpm-transmission
	unsigned gcr = (value ^ (value >> 1));

	uint32_t data = 0;

	// 20bits -> 5 mapped -> 4 nibbles
	for (unsigned i = 0; i < 4; ++i) {
		uint32_t nibble = nibbles_from_mapped(gcr & 0x1F) << (4 * i);

		if (nibble == 0xFF) {
			++read_fail_nibble[channel_index];;
			return 0;
		}

		data |= nibble;
		gcr >>= 5;
	}

	unsigned shift = (data & 0xE000) >> 13;
	unsigned period = ((data & 0x1FF0) >> 4) << shift;
	unsigned crc = data & 0xF;

	unsigned payload = (data & 0xFFF0) >> 4;
	unsigned calculated_crc = (~(payload ^ (payload >> 4) ^ (payload >> 8))) & 0x0F;

	if (crc != calculated_crc) {
		++read_fail_crc[channel_index];;
		return 0;
	}

	++read_ok[channel_index];;

	if (_edt_enabled) {
		// top nibble of the payload: 3 exponent bits + the mantissa MSB. An eRPM frame has a zero
		// nibble (period < 256) or the MSB set (the period is normalised, so it is always set when
		// the exponent is not zero). Everything else is an EDT frame.
		const unsigned prefix = (payload >> 8) & 0xF;

		if (prefix != 0 && (prefix & 1) == 0) {
			const unsigned type = (prefix >> 1) - 1; // 0x2 temp ... 0xE status
			++edt_count[channel_index][type];
			edt_last[channel_index][type] = payload & 0xFF;
			edt_last_time[channel_index][type] = hrt_absolute_time();
			*is_edt = true;
			return 0;
		}
	}

	return period;
}

#endif
